/*
Navicat MySQL Data Transfer

Source Server         : 10.16.79.8
Source Server Version : 50621
Source Host           : 10.16.79.8:3306
Source Database       : employertest

Target Server Type    : MYSQL
Target Server Version : 50621
File Encoding         : 65001

Date: 2018-01-04 15:25:39
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for jobentries
-- ----------------------------
DROP TABLE IF EXISTS `jobentries`;
CREATE TABLE `jobentries` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT COMMENT '主键，唯一id',
  `register` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '建立时间',
  `updatetime` datetime NOT NULL DEFAULT '2017-01-01 00:00:00' COMMENT '最后修改时间',
  `loginID` bigint(20) unsigned NOT NULL DEFAULT '0' COMMENT '登录ID',
  `unitName` varchar(50) NOT NULL DEFAULT '' COMMENT '单位名称',
  `companyTypeID` bigint(20) unsigned NOT NULL DEFAULT '0' COMMENT '单位类别',
  `stationTypeID` bigint(20) unsigned NOT NULL DEFAULT '0' COMMENT '岗位类别',
  `workingPlace` varchar(100) NOT NULL DEFAULT '' COMMENT '工作地点',
  `practiceTime` varchar(20) NOT NULL DEFAULT '' COMMENT '实习时间',
  `isAccommodate` int(1) NOT NULL DEFAULT '1' COMMENT '是否提供食宿：1是，2否',
  `numPeople` int(11) NOT NULL DEFAULT '0' COMMENT '人数',
  `remark` varchar(200) NOT NULL DEFAULT '' COMMENT '备注',
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=52 DEFAULT CHARSET=utf8 COMMENT='岗位录入表';

-- ----------------------------
-- Records of jobentries
-- ----------------------------
INSERT INTO `jobentries` VALUES ('27', '2017-06-19 15:28:19', '2017-06-22 10:21:59', '105', '宜昌市夷陵区社会保险事业管理局', '8', '5', '小溪塔街道', '3个月', '2', '4', '行政班，8小时工作制；两名办公室工作人员，两名业务科室工作人员。');
INSERT INTO `jobentries` VALUES ('28', '2017-06-19 15:30:15', '2017-06-20 10:19:06', '34', '湖北中和兴跨境电子商务有限公司', '5', '6', '夷陵经济开发区街道', '2个月', '2', '5', '跨境电子商务运营专员\r\n（一）任职要求：\r\n1、本科及以上学历，英语4级，小语种亦可；\r\n2、工作认真、细心、负责，有较强的沟通及表达能力，较强的团队合作精神；\r\n3、熟练操作网络交易平台及办公软件。\r\n（二）岗位职责:\r\n1、负责公司跨境电商平台的产品发布、更新及运营；\r\n2、产品上架，优化详情页，及时更新产品资料；\r\n3、维护账号，客服回复；\r\n4、处理客户投诉，对客户的退换货及退款进行妥善处');
INSERT INTO `jobentries` VALUES ('29', '2017-06-19 15:41:51', '2017-06-19 15:41:51', '29', '湖北联投恒达石墨有限公司', '5', '6', '夷陵经济开发区街道', '3个月', '2', '30', '本公司可提供材料技术、质检、化验、设备、测量、采矿、选矿、安全、环保、人力资源、财务、销售等岗位见习，市区及夷陵区户口优先，见习期1-3个月，提供中餐。');
INSERT INTO `jobentries` VALUES ('30', '2017-06-19 16:05:40', '2017-06-30 13:08:40', '125', '夷陵区分乡镇规划建设环境保护所', '8', '5', '分乡镇', '3个月', '1', '1', '单位位于分乡镇集镇，单位配有公车（仅在上班期间工作用），有宿舍，免费提供中餐，晚餐需要自理，实习人员有独立电脑、办公桌，宿舍有空调，有卫生间，卫生间提供24小时热水。单位主要职责为：村镇建设管理，环境信访处理，环境管理，规划管理，集镇管理，危房改造。设定实习岗位工作内容主要为资料整理、写一些简单材料，协助整理财务，可提供下村锻炼机会，协助管理村民建房和环境卫生检查。');
INSERT INTO `jobentries` VALUES ('31', '2017-06-20 08:19:23', '2017-06-26 11:15:55', '111', '宜昌市夷陵区广播电视台', '8', '4', '小溪塔街道', '2个月', '2', '6', '');
INSERT INTO `jobentries` VALUES ('32', '2017-06-20 09:44:42', '2017-06-20 09:44:42', '167', '夷陵区博物馆', '8', '5', '小溪塔街道', '2个月', '2', '2', '只提供午餐，实习时间1~2个月');
INSERT INTO `jobentries` VALUES ('33', '2017-06-21 18:13:28', '2017-06-30 09:12:13', '195', '宜昌市夷陵区动物疫病预防控制中心', '8', '4', '小溪塔街道', '2个月', '2', '0', '实验室检测、动物疫病防控');
INSERT INTO `jobentries` VALUES ('34', '2017-06-22 08:14:54', '2017-06-22 09:25:47', '89', '宜昌双岩生态农业开发有限公司 ', '5', '5', '小溪塔街道', '2个月', '1', '3', '运营2人，美工1人,提供工作餐，不提供住宿。');
INSERT INTO `jobentries` VALUES ('35', '2017-06-22 09:12:31', '2017-06-22 09:29:32', '259', '宜昌九座山农业专业合作社联合社', '5', '5', '小溪塔街道', '2个月', '1', '4', '农业项目管理2人，美丽乡村建设1人,水稻种植专业技术员1人，提供工作餐，不提供住宿。');
INSERT INTO `jobentries` VALUES ('36', '2017-06-22 09:14:49', '2017-06-22 09:24:22', '260', '宜昌廷龙科技发展有限公司', '5', '5', '0', '2个月', '1', '3', '运营策划2人/技术1人,提供工作餐，不提供住宿。');
INSERT INTO `jobentries` VALUES ('37', '2017-06-22 16:56:28', '2017-06-22 16:56:28', '271', '宜昌市夷陵区孝周果蔬种植专业合作社', '5', '5', '小溪塔街道', '2个月', '1', '2', '农业技术员工2名，提供工作餐，不提供宿。');
INSERT INTO `jobentries` VALUES ('38', '2017-06-22 16:57:47', '2017-06-22 16:57:47', '269', '宜昌市九条湾果蔬种植专业合作社', '5', '5', '小溪塔街道', '2个月', '1', '2', '农业技术员1人，市场运营1人。提供工作餐，不提供住宿。');
INSERT INTO `jobentries` VALUES ('39', '2017-06-22 16:59:18', '2017-06-22 16:59:18', '268', '宜昌市夷陵区山妹子养殖专业合作社', '5', '5', '小溪塔街道', '2个月', '1', '2', '农艺师1人，市场运营1人。提供工作餐，不提供住宿。');
INSERT INTO `jobentries` VALUES ('40', '2017-06-23 11:06:15', '2017-06-23 11:06:15', '232', '宜昌市夷陵区产品质量检验检测中心', '8', '4', '夷陵经济开发区街道', '2个月', '2', '4', '');
INSERT INTO `jobentries` VALUES ('41', '2017-06-23 11:11:33', '2017-06-23 11:11:33', '123', '均瑶集团乳业股份有限公司', '5', '6', '夷陵经济开发区街道', '3个月', '1', '31', '机电维修工5名：要求机电专业\r\n巡检员5名：食品相关专业\r\n一线操作20名：要求上夜班。白夜两班倒,每个班12个小时\r\n人事专员1名：人力资源专业\r\n');
INSERT INTO `jobentries` VALUES ('42', '2017-06-23 16:26:58', '2017-06-23 16:26:58', '537', '宜昌市夷陵区住房和城乡建设局', '7', '5', '小溪塔街道', '3个月', '2', '3', '提供午餐');
INSERT INTO `jobentries` VALUES ('43', '2017-06-23 16:43:05', '2017-06-23 16:43:05', '534', '葛洲坝易普力湖北昌泰民爆有限公司', '5', '6', '小溪塔街道', '2个月', '1', '16', '主要以下岗位：办公室工作人员	行政班、8小时\r\n人力资源岗位	行政班、8小时\r\n销售人员行政班\r\n测量员	野外作业综合工时\r\n安全员	野外作业综合工时\r\n工程施工	野外作业综合工时\r\n');
INSERT INTO `jobentries` VALUES ('44', '2017-06-30 12:30:47', '2017-06-30 12:30:47', '874', '宜昌贝特石墨新材料有限公司', '5', '6', '夷陵经济开发区街道', '3个月', '2', '3', '');
INSERT INTO `jobentries` VALUES ('45', '2017-06-30 17:10:18', '2017-06-30 17:37:30', '475', '宜昌市夷陵区国土资源局', '7', '5', '小溪塔街道', '1个月', '2', '6', '区国土资源局2人（秘书学、土地资源管理、人力资源管理专业）、区国土资源执法局2人（秘书学、法律专业）、区不动产登记中心1人（土地资源管理专业）、区国土资源调查队1人（测绘、测量工程专业）。');
INSERT INTO `jobentries` VALUES ('46', '2017-06-30 17:10:51', '2017-06-30 17:21:04', '475', '宜昌市夷陵区国土资源局', '7', '5', '分乡镇', '1个月', '2', '1', '分乡国土资源所1人。');
INSERT INTO `jobentries` VALUES ('47', '2017-06-30 17:32:14', '2017-06-30 17:32:14', '475', '宜昌市夷陵区国土资源局', '7', '5', '乐天溪镇', '1个月', '2', '1', '乐天溪国土资源所1人、土地资源管理专业');
INSERT INTO `jobentries` VALUES ('48', '2017-07-11 09:27:23', '2017-07-11 09:27:23', '984', '宜昌电德电子科技有限公司', '5', '5', '黄花镇', '1个月', '1', '2', '');
INSERT INTO `jobentries` VALUES ('49', '2017-07-11 09:27:42', '2017-07-11 09:27:42', '984', '宜昌电德电子科技有限公司', '5', '6', '黄花镇', '1个月', '1', '5', '');
INSERT INTO `jobentries` VALUES ('50', '2017-07-14 15:58:38', '2017-07-14 15:58:38', '1571', '宜昌城大建设有限公司', '5', '5', '东城试验区', '1个月', '1', '2', '');
INSERT INTO `jobentries` VALUES ('51', '2017-07-14 15:59:10', '2017-07-14 15:59:10', '1571', '宜昌城大建设有限公司', '5', '6', '东城试验区', '1个月', '1', '3', '');
