/*
Navicat MySQL Data Transfer

Source Server         : localhost
Source Server Version : 50621
Source Host           : 10.16.79.8:3306
Source Database       : employertest

Target Server Type    : MYSQL
Target Server Version : 50621
File Encoding         : 65001

Date: 2018-05-28 10:36:52
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for intentionforms
-- ----------------------------
DROP TABLE IF EXISTS `intentionforms`;
CREATE TABLE `intentionforms` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT COMMENT '主键，唯一id',
  `register` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '建立时间',
  `updatetime` datetime NOT NULL DEFAULT '2017-01-01 00:00:00' COMMENT '最后修改时间',
  `loginID` bigint(20) unsigned NOT NULL DEFAULT '0' COMMENT '登录ID',
  `name` varchar(20) NOT NULL DEFAULT '' COMMENT '姓名',
  `sex` int(2) NOT NULL DEFAULT '1' COMMENT '性别：1男，2女',
  `identity` varchar(18) NOT NULL DEFAULT '' COMMENT '身份证号码',
  `attendSchool` varchar(50) NOT NULL DEFAULT '' COMMENT '就读学校',
  `mobile` varchar(11) NOT NULL DEFAULT '' COMMENT '手机号',
  `contactName` varchar(20) NOT NULL DEFAULT '' COMMENT '紧急联系人',
  `contactPhone` varchar(11) NOT NULL DEFAULT '' COMMENT '紧急联系人电话',
  `companyTypeID` bigint(20) unsigned NOT NULL DEFAULT '0' COMMENT '意向单位类别',
  `stationTypeID` bigint(20) unsigned NOT NULL DEFAULT '0' COMMENT '意向岗位类别',
  `liveWhere` varchar(25) NOT NULL DEFAULT '' COMMENT '居住地',
  `wrokAddr` varchar(25) NOT NULL DEFAULT '',
  `entrance` varchar(20) NOT NULL,
  `graduation` varchar(20) NOT NULL,
  `education` varchar(10) NOT NULL,
  `major` varchar(30) NOT NULL,
  `intentionalUnit` varchar(45) NOT NULL DEFAULT '' COMMENT '意向单位名称',
  `bank` varchar(10) NOT NULL,
  `bankAccount` varchar(30) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  UNIQUE KEY `mobile_UNIQUE` (`mobile`)
) ENGINE=InnoDB AUTO_INCREMENT=2625 DEFAULT CHARSET=utf8 COMMENT='实习意向填报表';

-- ----------------------------
-- Records of intentionforms
-- ----------------------------
INSERT INTO `intentionforms` VALUES ('2585', '2018-05-24 18:14:30', '2018-05-24 18:14:30', '3323', '孙浩文', '1', '420521199710160016', '荆州长江大学', '15272196133', '谢玲锋', '15272196133', '0', '0', '', '', '2016-09-05', '2020-07-31', '本科', '会计学', '', '建设银行', '6217002660009839195');
INSERT INTO `intentionforms` VALUES ('2586', '2018-05-25 09:08:51', '2018-05-25 09:08:51', '3328', '李贝', '2', '420114199611011925', '三峡大学', '15327642971', '蒋杭', '18871758663', '0', '0', '', '', '2015-09-05', '2019-06-15', '本科', '行政管理', '', '农业银行', '6228480779528926172');
INSERT INTO `intentionforms` VALUES ('2587', '2018-05-25 09:34:32', '2018-05-25 09:34:32', '3331', '王臣颖', '2', '120222199601225625', '三峡大学', '17695705434', '王玉生', '15122656432', '0', '0', '', '', '2015-09-05', '2019-06-14', '本科', '行政管理', '', '农业银行', '6228480779528931974');
INSERT INTO `intentionforms` VALUES ('2588', '2018-05-25 09:38:19', '2018-05-25 09:38:19', '3332', '石万里', '1', '372330199409024210', '三峡大学', '15572710270', '石向征', '13563071687', '0', '0', '', '', '2013-09-04', '2019-06-01', '本科', '行政管理', '', '工商银行', '6228210770010744311');
INSERT INTO `intentionforms` VALUES ('2589', '2018-05-25 09:46:04', '2018-05-25 09:46:04', '3333', '谢佳惠', '2', '420704199706031726', '三峡大学', '13507201750', '徐梦元', '15871525928', '0', '0', '', '', '2015-09-05', '2019-06-15', '本科', '行政管理', '', '农业银行', '6228480779528926479');
INSERT INTO `intentionforms` VALUES ('2590', '2018-05-25 09:54:25', '2018-05-25 09:54:25', '3334', '陈俊', '1', '42282819950921621X', '三峡大学', '13508607232', '陈远丰', '13402794697', '0', '0', '', '', '2015-09-05', '2019-06-14', '本科', '行政管理', '', '农业银行', '6228480779753878270');
INSERT INTO `intentionforms` VALUES ('2591', '2018-05-25 10:04:28', '2018-05-25 10:04:28', '3335', '林修英', '2', '510112199608094220', '三峡大学', '13387273047', '万微', '13507203617', '0', '0', '', '', '2015-09-01', '2019-06-30', '本科', '行政管理', '', '农业银行', '6228480779528925372');
INSERT INTO `intentionforms` VALUES ('2592', '2018-05-25 10:05:26', '2018-05-25 10:05:26', '3336', '杨梅', '2', '420582199710106709', '三峡大学', '15897567865', '王秋叶', '13469829600', '0', '0', '', '', '2015-09-01', '2019-06-01', '本科', '行政管理', '', '农业银行', '6228480779528926578');
INSERT INTO `intentionforms` VALUES ('2594', '2018-05-25 10:06:03', '2018-05-25 10:06:03', '3337', '龙云', '2', '422801199507161243', '三峡大学', '13508607053', '吴宣芝', '13997794041', '0', '0', '', '', '2015-09-01', '2019-06-30', '本科', '行政管理', '', '农业银行', '6228480779528931479');
INSERT INTO `intentionforms` VALUES ('2595', '2018-05-25 10:55:58', '2018-05-25 10:55:58', '3340', '杨葵', '2', '422802199607160324', '三峡大学', '15587943770', '冉洪平', '13402729508', '0', '0', '', '', '2015-09-01', '2019-06-30', '本科', '行政管理', '', '农业银行', '6228480779528926974');
INSERT INTO `intentionforms` VALUES ('2596', '2018-05-25 11:31:57', '2018-05-25 11:31:57', '3341', '陈胜男', '2', '210303199708252322', '三峡大学', '13707207562', '杨新迪', '13674220965', '0', '0', '', '', '2015-09-05', '2019-06-30', '本科', '行政管理', '', '建设银行', '6210812831006357581');
INSERT INTO `intentionforms` VALUES ('2597', '2018-05-25 11:52:46', '2018-05-25 11:52:46', '3342', '黄盼盼', '2', '41108219980109002x', '三峡大学', '15327637451', '顿环宇', '18162392187', '0', '0', '', '', '2015-9', '2019-6', '本科', '行政管理', '', '农业银行', '6228480779616147970');
INSERT INTO `intentionforms` VALUES ('2598', '2018-05-25 12:36:32', '2018-05-25 12:36:32', '3343', '左亚杰', '1', '130481199706060057', '三峡大学', '18694080502', '左春军', '13930093127', '0', '0', '', '', '2015-09-05', '2019-06-08', '本科', '行政管理', '', '农业银行', '6228480779528925273');
INSERT INTO `intentionforms` VALUES ('2599', '2018-05-25 15:36:23', '2018-05-25 15:36:23', '3347', '旷百川', '1', '420102199802202016', '湖北交通职业技术学院', '13260601908', '旷卫烽', '13207102697', '0', '0', '', '', '2016-09-01', '2019-07-01', '大专', '汽车运用', '', '工商银行', '6212263202010002664');
INSERT INTO `intentionforms` VALUES ('2600', '2018-05-25 19:06:52', '2018-05-25 19:06:52', '3348', '邓芮', '2', '420115199707040065', '三峡大学', '18627995160', '班雅琳', '13986831080', '0', '0', '', '', '2015-09-07', '2019-06-30', '本科', '行政管理', '', '农业银行', '6228480779528928376');
INSERT INTO `intentionforms` VALUES ('2601', '2018-05-25 19:12:08', '2018-05-25 19:12:08', '3329', '陶俊宏', '1', '330723199702065379', '三峡大学', '13986831131', '陶晓仙', '15888988329', '0', '0', '', '', '2015-09-01', '2019-06-01', '本科', '行政管理', '', '农业银行', '6228480779616255773');
INSERT INTO `intentionforms` VALUES ('2605', '2018-05-26 11:14:06', '2018-05-26 11:14:06', '3345', '向凤雏', '1', '420529199612203319', '三峡大学', '13477842697', '张琴', '15972725456', '0', '0', '', '', '2015-09-01', '2019-06-01', '本科', '行政管理', '', '工商银行', '6222031807000146675');
INSERT INTO `intentionforms` VALUES ('2607', '2018-05-26 15:26:53', '2018-05-26 15:26:53', '3350', '禹和展', '1', '412822199503193774', '三峡大学', '13165618082', '余红丽', '13530483499', '0', '0', '', '', '2015-09-05', '2019-06-05', '本科', '行政管理', '', '工商银行', '6215581807006330248');
INSERT INTO `intentionforms` VALUES ('2608', '2018-05-26 17:30:41', '2018-05-26 17:30:41', '3352', '黄佳敏', '2', '421182199803020241', '三峡大学', '13507202262', '孙丽萍', '15272020330', '0', '0', '', '', '2015-09-01', '2019-06-30', '本科', '行政管理', '', '农业银行', '6228480779528928673');
INSERT INTO `intentionforms` VALUES ('2609', '2018-05-26 17:48:44', '2018-05-26 17:48:44', '3353', '温立伦', '1', '420521199708180018', '武汉工程科技学院', '15871643040', '魏继红', '13972552109', '0', '0', '', '', '2016-09-01', '2020-01-20', '本科', '财务管理', '', '建设银行', '6217002830005231230');
INSERT INTO `intentionforms` VALUES ('2613', '2018-05-26 17:54:34', '2018-05-26 17:54:34', '3354', '刘琰', '2', '420521199712080044', '三峡大学科技学院', '15872667705', '刘爱群', '13807206863', '0', '0', '', '', '2016-09-01', '2020-06-10', '本科', '财务管理', '', '工商银行', '6217231807002198326');
INSERT INTO `intentionforms` VALUES ('2614', '2018-05-26 22:56:15', '2018-05-26 22:56:15', '3356', '张圆嫄', '2', '420521199908285324', '湖北经济学院', '13469850645', '张国金', '13986778779', '0', '0', '', '', '2017-09-07', '2021-06-08', '本科', '法学', '', '农业银行', '6228270051495861574');
INSERT INTO `intentionforms` VALUES ('2615', '2018-05-26 23:28:53', '2018-05-26 23:28:53', '3357', '夏盼', '2', '42122319960406292x', '三峡大学', '15272688336', '杨望福', '18872822707', '0', '0', '', '', '2015-09-05', '2019-06-18', '本科', '行政管理', '', '建设银行', '6236682830001224376');
INSERT INTO `intentionforms` VALUES ('2616', '2018-05-27 13:26:39', '2018-05-27 13:26:39', '3358', '李奕萱', '2', '420103199711033727', '三峡大学', '17786109157', '李勇', '13006330330', '0', '0', '', '', '2015-09-01', '2019-06-30', '本科', '行政管理', '', '工商银行', '6222023202036580008');
INSERT INTO `intentionforms` VALUES ('2617', '2018-05-27 15:21:37', '2018-05-27 15:21:37', '3344', '朱涧槐', '2', '421127199805163225', '三峡大学', '13507203220', '米雅洁', '15572715507', '0', '0', '', '', '2015-09-05', '2019', '本科', '行政管理', '', '农业银行', '6228481629444360379');
INSERT INTO `intentionforms` VALUES ('2618', '2018-05-27 17:47:37', '2018-05-27 17:47:37', '3359', '王杨洋', '2', '420521199610050020', '四川文理学院', '18780192034', '杨承宝', '13972575195', '0', '0', '', '', '2014-09-04', '2017-07-01', '本科', '工程造价', '', '工商银行', '6217232317000076002');
INSERT INTO `intentionforms` VALUES ('2623', '2018-05-28 10:00:04', '2018-05-28 10:00:04', '3327', '曾辉', '1', '420521199012150013', '武体', '18671758898', '曾庆全', '13972031808', '0', '0', '', '', '2018-05-02', '2018-05-23', '大专', '经济学', '', '工商银行', '6210812831001545560');
INSERT INTO `intentionforms` VALUES ('2624', '2018-05-28 10:03:27', '2018-05-28 10:03:27', '3361', '周子誉', '2', '420521199612040045', '武汉学院', '15971671485', '15872571598', '15872552646', '0', '0', '', '', '2016-09-01', '2019-06-05', '本科', '英语', '', '工商银行', '6217002830003287085');
