/*
Navicat MySQL Data Transfer

Source Server         : localhost
Source Server Version : 50621
Source Host           : 10.16.79.8:3306
Source Database       : employertest

Target Server Type    : MYSQL
Target Server Version : 50621
File Encoding         : 65001

Date: 2018-05-28 10:37:16
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for login
-- ----------------------------
DROP TABLE IF EXISTS `login`;
CREATE TABLE `login` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT COMMENT '主键，唯一id',
  `register` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '建立时间',
  `userType` int(2) NOT NULL DEFAULT '1' COMMENT '用户类型：1企业，2学生',
  `mobile` varchar(11) NOT NULL DEFAULT '' COMMENT '手机号',
  `vcode` varchar(6) NOT NULL DEFAULT '' COMMENT '验证码',
  `userName` varchar(50) NOT NULL DEFAULT '' COMMENT '用户名：企业名/学生用户名',
  `password` varchar(45) NOT NULL DEFAULT '' COMMENT '密码',
  `Name` varchar(50) NOT NULL DEFAULT '' COMMENT '名称：企业单位名称，学生姓名',
  `vcodeNum` int(1) NOT NULL,
  `IP` varchar(45) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  UNIQUE KEY `mobile_UNIQUE` (`mobile`)
) ENGINE=InnoDB AUTO_INCREMENT=3362 DEFAULT CHARSET=utf8 COMMENT='登录表';

-- ----------------------------
-- Records of login
-- ----------------------------
INSERT INTO `login` VALUES ('3323', '2018-05-24 14:46:40', '2', '15272196133', '8313', '孙浩文', '761025', '孙浩文', '1', '219.139.44.111');
INSERT INTO `login` VALUES ('3324', '2018-05-26 09:04:15', '2', 'atestu', 'atestu', '${52431812+88572038}', 'atestpwdu', '13800138000', '1', '27.26.176.59');
INSERT INTO `login` VALUES ('3326', '2018-05-25 07:56:23', '2', '\'\"()&%lywhc', 'atestu', 'atestuseru', 'atestpwdu', '13800138000', '1', '27.26.176.59');
INSERT INTO `login` VALUES ('3327', '2018-05-28 09:55:36', '2', '18671758898', '6253', 'zaqzqa', 'zaqzqa', '增輝', '2', '219.139.44.108');
INSERT INTO `login` VALUES ('3328', '2018-05-25 09:01:37', '2', '15327642971', '7248', '李贝', '199611011925', '李贝', '1', '171.44.168.106');
INSERT INTO `login` VALUES ('3329', '2018-05-25 09:19:45', '2', '13986831131', '7412', '陶俊宏', 'qq7140qq', '陶俊宏', '1', '219.139.44.101');
INSERT INTO `login` VALUES ('3330', '2018-05-25 09:20:45', '2', '15192201001', '5463', '康瑜', 'Ky970729', '康瑜', '1', '219.139.44.110');
INSERT INTO `login` VALUES ('3331', '2018-05-25 09:25:26', '2', '17695705434', '4867', 'wcy49', 'wl517249', '王臣颖', '1', '219.139.44.100');
INSERT INTO `login` VALUES ('3332', '2018-05-25 09:33:42', '2', '15572710270', '7217', '19940727', '940727', '石万里', '1', '219.139.44.97');
INSERT INTO `login` VALUES ('3333', '2018-05-25 09:41:01', '2', '13507201750', '5164', 'javal', 'szwj77mm', '谢佳惠', '3', '219.139.44.100');
INSERT INTO `login` VALUES ('3334', '2018-05-25 09:49:31', '2', '13508607232', '5627', '陈俊', 'cj950921', '陈俊', '1', '219.139.44.100');
INSERT INTO `login` VALUES ('3335', '2018-05-25 09:56:42', '2', '13387273047', '5364', '林修英', '2297347403', '林修英', '1', '219.139.44.12');
INSERT INTO `login` VALUES ('3336', '2018-05-25 09:59:44', '2', '15897567865', '5152', '杨梅', '15897567865ym', '杨梅', '1', '219.139.44.97');
INSERT INTO `login` VALUES ('3337', '2018-05-25 10:02:28', '2', '13508607053', '7321', 'Ailsa', 'longyun950716', '龙云', '1', '219.139.44.99');
INSERT INTO `login` VALUES ('3338', '2018-05-25 11:34:02', '2', '13177219828', '2145', 'ZXY', 'zxy282113327', '周香炎', '2', '219.139.44.101');
INSERT INTO `login` VALUES ('3339', '2018-05-25 10:44:16', '2', '15207205770', '3248', '石星', 'sx15207205770', '石星', '2', '117.136.53.117');
INSERT INTO `login` VALUES ('3340', '2018-05-25 10:48:54', '2', '15587943770', '8726', 'yangkui', 'YK1970312716', '杨葵', '1', '219.139.44.108');
INSERT INTO `login` VALUES ('3341', '2018-05-25 11:27:41', '2', '13707207562', '7318', '陈胜男', '13707207562', '陈胜男', '1', '219.139.44.100');
INSERT INTO `login` VALUES ('3342', '2018-05-25 11:46:33', '2', '15327637451', '2315', '黄盼盼', 'qwe19980109', '黄盼盼', '1', '219.139.44.98');
INSERT INTO `login` VALUES ('3343', '2018-05-25 12:32:25', '2', '18694080502', '1267', 'Aget Zuo', 'Zyjtbabm0702', '左亚杰', '1', '219.139.44.101');
INSERT INTO `login` VALUES ('3344', '2018-05-25 14:19:16', '2', '13507203220', '4310', 'zhujianhuai', 'zjh980516', '朱涧槐', '1', '219.139.44.108');
INSERT INTO `login` VALUES ('3345', '2018-05-25 14:38:11', '2', '13477842697', '6478', '2015120219', 'xfc19961220', '向凤雏', '1', '219.139.44.105');
INSERT INTO `login` VALUES ('3346', '2018-05-25 15:12:12', '2', '13507203501', '1753', '王露', '2015120216', '王露', '1', '219.139.44.97');
INSERT INTO `login` VALUES ('3347', '2018-05-25 15:32:54', '2', '13260601908', '1812', '旷百川', '123456', '旷百川', '1', '61.151.178.174');
INSERT INTO `login` VALUES ('3348', '2018-05-25 19:03:35', '2', '18627995160', '5462', '邓芮', '2087148', '邓芮', '1', '183.240.92.12');
INSERT INTO `login` VALUES ('3349', '2018-05-25 19:33:56', '2', '13165618080', '3472', '', '', '', '1', '27.21.8.239');
INSERT INTO `login` VALUES ('3350', '2018-05-25 19:35:10', '2', '13165618082', '7252', 'nanana', 'yhz19960315', '禹和展', '1', '27.21.8.239');
INSERT INTO `login` VALUES ('3351', '2018-05-26 17:15:50', '2', '15587930820', '8474', 'a1820115292', '1@helloworld', '康云龙', '2', '113.57.183.122');
INSERT INTO `login` VALUES ('3352', '2018-05-26 17:26:57', '2', '13507202262', '5868', '黄佳敏', '897286359', '黄佳敏', '1', '117.136.53.82');
INSERT INTO `login` VALUES ('3353', '2018-05-26 17:46:14', '2', '15871643040', '5248', 'WLL', 'wenlilun1', '温立伦', '1', '183.95.184.133');
INSERT INTO `login` VALUES ('3354', '2018-05-26 17:51:23', '2', '15872667705', '3872', 'LY1208', 'YANYAN314159', '刘琰', '1', '117.136.81.88');
INSERT INTO `login` VALUES ('3355', '2018-05-26 18:55:52', '2', '15872461246', '5218', 'zdd', '19980907', '张丹丹', '1', '119.100.143.227');
INSERT INTO `login` VALUES ('3356', '2018-05-26 22:48:39', '2', '13469850645', '8276', '橘遥', 'jiayou123.,', '张圆嫄', '1', '113.57.74.16');
INSERT INTO `login` VALUES ('3357', '2018-05-26 23:24:52', '2', '15272688336', '7428', '夏盼', '2015120315', '夏盼', '1', '171.44.160.41');
INSERT INTO `login` VALUES ('3358', '2018-05-27 13:23:21', '2', '17786109157', '6381', '李奕萱', '2087076', '李奕萱', '1', '119.103.161.77');
INSERT INTO `login` VALUES ('3359', '2018-05-27 17:39:24', '2', '17738641870', '8712', 'wyy105', 'Wyy19961005', '王杨洋', '1', '139.207.57.196');
INSERT INTO `login` VALUES ('3360', '2018-05-28 08:40:32', '2', '13872611531', '4213', '李顺红', '1997901abc', '李顺红', '1', '117.136.53.63');
INSERT INTO `login` VALUES ('3361', '2018-05-28 09:51:23', '2', '15971671485', '2712', '周子誉', '687095', '周子誉', '1', '219.139.44.106');
